Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལུས་མི་དམིགས་པ་དང་། ངག་དང་སེམས་མི་དམིགས་པ་དེའི་ཚེ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལུས་དང་ངག་དང་ཡིད་ཀྱི་གནས་ངན་ལེན་ཡོངས་སུ་སྦྱོང་བ་ཡིན་ནོ།
en: Śāradvatīputra,” replied the Blessed One, “whenever bodhisattva great beings do not apprehend the physical body, and they do not apprehend speech and mind, {Dt.74} then these bodhisattva great beings purify the factors of the body that take on negative states and purify the factors of speech and mind that take on negative states. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་ཕྱིན་ཆད། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་ཡང་དག་པར་བླངས་ཏེ་གནས་ཤིང་།
en: Moreover, Śāradvatīputra, bodhisattva great beings, commencing from the time when they first begin to set their mind on enlightenment, adopt and continue to pursue the paths associated with the ten virtuous actions.

source: ཉན་ཐོས་ཀྱི་སེམས་སམ་རང་སངས་རྒྱས་ཀྱི་སེམས་བསྐྱེད་པ་མེད་པར་དེ་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོའི་སེམས་ཉེ་བར་གཞོག་ན།
en: They never develop the mindsets of the śrāvakas and pratyekabuddhas, but they do indeed establish an attitude of great compassion at all times for the sake of all beings.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལུས་དང་ངག་དང་ཡིད་ཀྱི་གནས་ངན་ལེན་ཡོངས་སུ་དག་པ་ཞེས་ངས་བཤད་དོ།
en: Accordingly, I say that the factors of body, speech, and mind that take on negative states, which bodhisattva great beings might have, will be purified. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་བྱང་ཆུབ་ཀྱི་ལམ་ཡོངས་སུ་སྦྱོང་ཞིང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དག་ཀྱང་ཡོད་དོ།
en: Śāradvatīputra, there are also bodhisattva great beings practicing the perfection of wisdom who refine the path to enlightenment, and who practice the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་ཀྱི་ལམ་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ནམ་ལུས་ལ་དམིགས་པ་མེད་པ་དང་།
en: Blessed Lord, what is bodhisattva great beings’ path to enlightenment?”

source: ངག་དང་ཡིད་ལ་དམིགས་པ་མེད་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དམིགས་པ་མེད་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དམིགས་པ་མེད་པ་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་དམིགས་པ་མེད་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་དམིགས་པ་མེད་པ་དང་།
en: The Blessed One replied, “When bodhisattva great beings practice the perfection of wisdom, they never apprehend the body, and they never apprehend speech or mind; they never apprehend the perfection of generosity, and they never apprehend the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom; and they never apprehend the vehicle of the śrāvakas, they never apprehend the vehicle of the pratyekabuddhas, and they never apprehend the vehicle of the bodhisattvas or the vehicle of the completely awakened buddhas.

source: བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་དང་། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་དམིགས་པ་མེད་པར་གྱུར་པ་དེ་ནི། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་ཀྱི་ལམ་ཡིན་ཏེ།
en: This, Śāradvatīputra, is the path to enlightenment that bodhisattva great beings will have.

source: དེ་ལྟར་ཆོས་ཐམས་ཅད་ལ་དམིགས་པ་མེད་ཅིང་བླང་བ་མེད་པ་དང་དོར་བ་མེད་པའོ།
en: So it is that all phenomena are nonapprehensible, without acceptance and without rejection.

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལམ་དེ་ལྟ་བུས་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་ཅིང་ནན་ཏན་དུ་བྱེད་པ་དེ་དག་ནི་སུས་ཀྱང་ཐུབ་པ་མེད་དོ། །གསོལ་པ།
en: Śāradvatīputra, bodhisattva great beings who practice and earnestly apply the six perfections in that manner cannot be overcome by anyone.” “

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཇི་ལྟ་བུར་སྤྱོད་པ་རྣམས་ཐུབ་པ་མ་མཆིས་པ་ལགས།
en: Blessed Lord, in what manner do bodhisattva great beings practice without being overcome?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ནམ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གཟུགས་ལ་རློམ་སེམས་མེད་པ་དང་།
en: The Blessed One replied, “When bodhisattva great beings practice the perfection of wisdom they do not give rise to conceits about physical forms. {

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ལ་རློམ་སེམས་མེད་པ་དང་།
en: Dt.75} They do not give rise to conceits about feelings, perceptions, formative predispositions, or consciousness.

source: མིག་དང་གཟུགས་ལ་རློམ་སེམས་མེད་པ་དང་།
en: They do not give rise to conceits about the eyes and sights.

source: རྣ་བ་དང་སྒྲ་དང་སྣ་དང་དྲི་དང་ལྕེ་དང་རོ་དང་ལུས་དང་རེག་བྱ་དང་། ཡིད་དང་ཆོས་ལ་རློམ་སེམས་མེད་པ་དང་། སའི་ཁམས་ལ་རློམ་སེམས་མེད་པ་དང་།
en: They do not give rise to conceits about the ears and sounds, the nose and odors, the tongue and tastes, the body and tangibles, or the mental faculty and mental phenomena.

source: ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་ལ་རློམ་སེམས་མེད་པ་དང་།
en: They do not give rise to conceits about the earth element, the water element, the fire element, the wind element, the space element, or the consciousness element.

source: མིག་གི་ཁམས་ལ་རློམ་སེམས་མེད་པ་དང་།
en: They do not give rise to conceits about the sensory element of the eyes.

source: གཟུགས་ཀྱི་ཁམས་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་ལ་རློམ་སེམས་མེད་པ་དང་། རྣ་བའི་ཁམས་དང་།
en: They do not give rise to conceits about the sensory element of sights or the sensory element of visual consciousness.

source: སྒྲའི་ཁམས་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། སྣའི་ཁམས་དང་། དྲིའི་ཁམས་དང་། སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། ལྕེའི་ཁམས་དང་། རོའི་ཁམས་དང་། ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། ལུས་ཀྱི་ཁམས་དང་། རེག་བྱའི་ཁམས་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། ཡིད་ཀྱི་ཁམས་ལ་རློམ་སེམས་མེད་པ་དང་། ཆོས་ཀྱི་ཁམས་ལ་རློམ་སེམས་མེད་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ལ་རློམ་སེམས་མེད་པ་དང་།
en: They do not give rise to conceits about the sensory element of the ears, the sensory element of sounds, the sensory element of auditory consciousness, the sensory element of the nose, the sensory element of odors, the sensory element of olfactory consciousness, the sensory element of the tongue, the sensory element of tastes, the sensory element of gustatory consciousness, the sensory element of the body, the sensory element of touch, the sensory element of tactile consciousness, the sensory element of the mental faculty, the sensory element of mental phenomena, or the sensory element of mental consciousness.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་རློམ་སེམས་མེད་པ་དང་།
en: They do not give rise to conceits about dependent origination.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རློམ་སེམས་མེད་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: They do not give rise to conceits about the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་རློམ་སེམས་མེད་པ་དང་། ནང་སྟོང་པ་ཉིད་ལ་རློམ་སེམས་མེད་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་རློམ་སེམས་མེད་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་།
en: They do not give rise to conceits about the emptiness of internal phenomena, and they do not give rise to conceits about [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་རློམ་སེམས་མེད་པ་དང་།
en: They do not give rise to conceits about the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, or the noble eightfold path.

source: འཕགས་པའི་བདེན་པ་བཞི་ལ་རློམ་སེམས་མེད་པ་དང་།
en: They do not give rise to conceits about the four truths of the noble ones.

source: བསམ་གཏན་བཞི་ལ་རློམ་སེམས་མེད་པ་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་ལ་རློམ་སེམས་མེད་པ་དང་།
en: They do not give rise to conceits about the four meditative concentrations, and they do not give rise to conceits about the four immeasurable attitudes or the four formless absorptions.

source: རྣམ་པར་ཐར་བ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་རློམ་སེམས་མེད་པ་དང་།
en: They do not give rise to conceits about the eight aspects of liberation or the nine serial steps of meditative absorption.

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ལ་རློམ་སེམས་མེད་པ་དང་།
en: They do not give rise to conceits about emptiness, signlessness, or wishlessness.

source: མངོན་པར་ཤེས་པ་རྣམས་ལ་རློམ་སེམས་མེད་པ་དང་།
en: They do not give rise to conceits about the extrasensory powers.

source: ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་རློམ་སེམས་མེད་པ་དང་།
en: They do not give rise to conceits about the gateways of the meditative stabilities or the dhāraṇīs.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ལ་རློམ་སེམས་མེད་པ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་རློམ་སེམས་མེད་པ་དང་།
en: They do not give rise to conceits about the ten powers of the tathāgatas, and they do not give rise to conceits about the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, or the eighteen distinct qualities of the buddhas.

source: རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ལ་རློམ་སེམས་མེད་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་ལ་རློམ་སེམས་མེད་པ་དང་།
en: They do not give rise to conceits about the fruit of entering the stream to nirvāṇa, and they do not give rise to conceits about the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, or the fruit of arhatship.

source: རང་བྱང་ཆུབ་ལ་རློམ་སེམས་མེད་པ་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ལ་རློམ་སེམས་མེད་པ་དང་།
en: They do not give rise to conceits about individual enlightenment and they do not give rise to conceits about knowledge of the path.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རློམ་སེམས་མེད་པ་དང་།
en: They do not give rise to conceits about unsurpassed, complete enlightenment.

source: འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་ལ་རློམ་སེམས་མེད་པར་གྱུར་པ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་གིས་རྣམ་པར་འཕེལ་བ་ཡིན་ཏེ་སུས་ཀྱང་ཐུབ་པ་མེད་དོ།
en: When they never give rise to conceits about cyclic existence or nirvāṇa, those bodhisattva great beings will flourish through the six perfections. They cannot be overcome by anyone! “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་གནས་ཏེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་བྱེད་ཅིང་།
en: Śāradvatīputra, there are also bodhisattva great beings who maintain the six perfections, and who perfect the wisdom of all-aspect omniscience.

source: ཡེ་ཤེས་དེ་དང་ལྡན་པས་ནམ་ཡང་ངན་སོང་རྣམས་སུ་མི་སྐྱེ།
en: Those who have this wisdom will never be reborn in the lower realms.

source: མི་དབུལ་ཞིང་ཕོངས་པ་ཉམས་སུ་མྱོང་བར་མི་འགྱུར་ཏེ།
en: They will never be impoverished or belittled. {

source: ལུས་གང་དང་ལྡན་པས། ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱི་ནང་ན་སྨད་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ལུས་ཡོངས་སུ་འཛིན་པར་མི་འགྱུར་བ་དག་ཀྱང་ཡོད་དོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Dt.76} As for their corporeal form, they will not acquire a body that is disparaged in the worlds of humans, gods, or asuras.”

source: །བཅོམ་ལྡན་འདས་དེ་ལྟ་བུའི་ཡེ་ཤེས་དང་ལྡན་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་ཡང་ངན་སོང་རྣམས་སུ་སྐྱེ་བར་མི་འགྱུར་བ་དང་། མི་དབུལ་ཞིང་ཕོངས་པ་ཉམས་སུ་མྱོང་བར་མི་འགྱུར་བ་དང་། ལུས་གང་དང་ལྡན་པས་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་གྱི་ནང་ན། སྨད་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ལུས་ཡོངས་སུ་འཛིན་པར་མི་འགྱུར་བའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་དེ་གང་ལགས།
en: Then the venerable Śāradvatīputra asked the Blessed One, “Blessed Lord, if bodhisattva great beings are endowed with such wisdom, whereby they would never fall into the lower realms of existence, never be impoverished or belittled, and never have a corporeal form that is disparaged in the worlds of gods, humans, or asuras, what is that wisdom of all-aspect omniscience?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡེ་ཤེས་དེ་ལྟ་བུ་དང་ལྡན་པས་ནི། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱང་མཐོང་ངོ་། །ཆོས་ཀྱང་ཉན་ཏོ།
en: Śāradvatīputra,” replied the Blessed One, “if bodhisattva great beings are endowed with that wisdom, in the world systems of the eastern direction, as numerous as the grains of sand of the river Gaṅgā, they will perceive tathāgatas, arhats, and completely awakened buddhas as numerous as the grains of sand of the river Gaṅgā, and they will listen to their sacred teachings.

source: །བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་རྣམ་པར་ཕྱེ་བ་དག་ཀྱང་མཐོང་ངོ་།
en: They will also perceive the community of the bodhisattvas and the distinguished attributes of the buddhafields.

source: །ལྷོ་དང་ནུབ་དང་བྱང་དང་བྱང་ཤར་དང་ཤར་ལྷོ་དང་ལྷོ་ནུབ་དང་ནུབ་བྱང་དང་། འོག་དང་སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱང་མཐོང་ངོ་། །ཆོས་ཀྱང་ཉན་ཏོ། །བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་།
en: In the world systems of the buddhafields in each of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā, they will also perceive tathāgatas, arhats, and completely awakened buddhas, as numerous as the grains of sand of the river Gaṅgā, and they will listen to their sacred teachings.

source: སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་རྣམ་པར་ཕྱེ་བ་དག་ཀྱང་མཐོང་ངོ་། །ཡེ་ཤེས་དེ་ལྟ་བུ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སངས་རྒྱས་ཀྱི་འདུ་ཤེས་མི་སྐྱེད་དོ། །ཆོས་ཀྱི་འདུ་ཤེས་དང་དགེ་འདུན་གྱི་འདུ་ཤེས་མི་སྐྱེད་དོ།
en: They will also perceive the community of the bodhisattvas and the distinguished attributes of the buddhafields. “

source: །ཉན་ཐོས་ཀྱི་འདུ་ཤེས་དང་རང་སངས་རྒྱས་ཀྱི་འདུ་ཤེས་དང་། བྱང་ཆུབ་སེམས་དཔའི་འདུ་ཤེས་དང་། སངས་རྒྱས་ཀྱི་འདུ་ཤེས་མི་སྐྱེད་དོ། །བདག་གི་འདུ་ཤེས་མི་སྐྱེད་དོ། །གཞན་གྱི་འདུ་ཤེས་མི་སྐྱེད་དོ།
en: Bodhisattva great beings endowed with that wisdom do not develop notions of Buddha, they do not develop notions of Dharma, or notions of Saṅgha; they do not develop notions of śrāvakas, notions of pratyekabuddhas, notions of bodhisattvas, or notions of buddhas; they do not develop notions of self, they do not develop notions of others, and they do not develop notions of buddhafields. “

source: །སངས་རྒྱས་ཀྱི་ཞིང་གི་འདུ་ཤེས་མི་སྐྱེད་དོ། །ཡེ་ཤེས་དེ་ལྟ་བུ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དེ། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མི་དམིགས་སོ།
en: Bodhisattva great beings who are endowed with that wisdom practice the perfection of generosity, but they do not apprehend the perfection of generosity.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དེ། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་དམིགས་སོ།
en: They practice the perfection of ethical discipline, but they do not apprehend the perfection of ethical discipline.

source: །བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་དེ། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མི་དམིགས་སོ།
en: They practice the perfection of tolerance, but they do not apprehend the perfection of tolerance.

source: །བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དེ། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་དམིགས་སོ།
en: They practice the perfection of perseverance, but they do not apprehend the perfection of perseverance.

source: །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དེ། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་དམིགས་སོ།
en: They practice the perfection of meditative concentration, but they do not apprehend the perfection of meditative concentration.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་དམིགས་སོ།
en: They practice the perfection of wisdom, but they do not apprehend the perfection of wisdom. “

source: །ནང་སྟོང་པ་ཉིད་སྒོམ་སྟེ། ནང་སྟོང་པ་ཉིད་མི་དམིགས་སོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་སྒོམ་སྟེ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་མི་དམིགས་སོ། །དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་།
en: They cultivate the emptiness of internal phenomena and [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, but they do not apprehend them, up to and including the emptiness of the essential nature of nonentities.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྒོམ་སྟེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་མི་དམིགས་སོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: They cultivate the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path, but they do not apprehend the noble eightfold path [and so forth].

source: རྣམ་པར་ཐར་བ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་སྒོམ་སྟེ། མངོན་པར་ཤེས་པ་རྣམས་མི་དམིགས་སོ།
en: They cultivate the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers, but they do not apprehend the extrasensory powers [and so forth].

source: །ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་སྒོམ་སྟེ། གཟུངས་ཀྱི་སྒོ་རྣམས་མི་དམིགས་སོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་།
en: They cultivate the gateways of the meditative stabilities and the dhāraṇīs, but they do not apprehend the dhāraṇī gateways [and so forth].

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་སྒོམ་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་མི་དམིགས་སོ། །རྒྱུན་དུ་ཞུགས་པ་དང་།
en: They cultivate the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas, but they do not apprehend the eighteen distinct qualities of the buddhas [and so forth].

source: ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སྒོམ་སྟེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མི་དམིགས་སོ།
en: They cultivate [the fruits of] entering the stream to nirvāṇa, of being destined for only one more rebirth, of not being reborn [in cyclic existence], and of arhatship, individual enlightenment, and [the other attainments], up to and including all-aspect omniscience, but they do not apprehend all-aspect omniscience [and so forth]. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཡེ་ཤེས་ཏེ།
en: This, Śāradvatīputra, is the wisdom of bodhisattva great beings.

source: ཡེ་ཤེས་དེ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Bodhisattva great beings who are endowed with this wisdom perfect the qualities of the buddhas, but they do not observe all those qualities of the buddhas. {

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། མིག་ལྔ་རབ་ཏུ་འཐོབ་པ་དང་། ཡོངས་སུ་སྦྱོང་བ་ཡོད་དོ། །ལྔ་གང་ཞེ་ན།
en: Dt.77} “Śāradvatīputra, bodhisattva great beings will acquire and refine the five eyes when they practice the perfection of wisdom in that manner.

source: འདི་ལྟ་སྟེ། ཤའི་མིག་དང་། ལྷའི་མིག་དང་། ཤེས་རབ་ཀྱི་མིག་དང་། ཆོས་ཀྱི་མིག་དང་།
en: If you ask what these are, they comprise the eye of flesh, the eye of divine clairvoyance, the eye of wisdom, the eye of the Dharma, and the eye of a buddha.” “

source: སངས་རྒྱས་ཀྱི་མིག་གོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤའི་མིག་ཡོངས་སུ་དག་པ་གང་ལགས།
en: Blessed Lord, what is the refined eye of flesh possessed by bodhisattva great beings?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤའི་མིག་གིས་དཔག་ཚད་བརྒྱ་མཐོང་བ་ཡོད་དོ།
en: Śāradvatīputra,” replied the Blessed One, “there are bodhisattva great beings who can indeed see with their eyes of flesh as far as a hundred yojanas.

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤའི་མིག་གིས་དཔག་ཚད་ཉིས་བརྒྱ་དང་། སུམ་བརྒྱ་དང་། བཞི་བརྒྱ་དང་། ལྔ་བརྒྱ་དང་། སྟོང་གི་བར་དུ་མཐོང་བ་ཡོད་དོ།
en: Śāradvatīputra, there are bodhisattva great beings who can see with their eyes of flesh as far as two hundred, three hundred, four hundred, five hundred, and up to a thousand yojanas.

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤའི་མིག་གིས་འཛམ་བུའི་གླིང་མཐོང་བ་ཡོད་དོ། །ཤའི་མིག་གིས་གླིང་གཉིས་དང་། གླིང་གསུམ་དང་། གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་མཐོང་བ་ཡོད་དོ། །ཤའི་མིག་གིས་སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་མཐོང་བ་ཡོད་དོ།
en: Śāradvatīputra, there are bodhisattva great beings who can see with their eyes of flesh across the entire continent of Jambudvīpa, and those who can see with their eyes of flesh across two continents, three continents, or the entire world system comprising four great continents.

source: །ཤའི་མིག་གིས་སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་མཐོང་བ་ཡོད་དོ།
en: Śāradvatīputra, there are bodhisattva great beings who can see with their eyes of flesh across an entire chiliocosm, and there are those who can see with their eyes of flesh across an entire dichiliocosm.

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤའི་མིག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་མཐོང་བ་ཡོད་དོ།
en: Śāradvatīputra, there are bodhisattva great beings who can see with their eyes of flesh across an entire great trichiliocosm.

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤའི་མིག་ཡོངས་སུ་དག་པའོ། །གསོལ་པ།
en: Śāradvatīputra, this is the refined eye of flesh possessed by bodhisattva great beings.” “

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལྷའི་མིག་ཡོངས་སུ་དག་པ་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, what is the refined eye of divine clairvoyance possessed by bodhisattva great beings?” “

source: ཤ་ར་དྭ་ཏིའི་བུ་རྒྱལ་པོ་ཆེན་པོ་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱི་ལྷའི་མིག་གང་ཡིན་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔས་རབ་ཏུ་ཤེས་སོ། །སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཚངས་རིས་དང་།
en: Śāradvatīputra,” replied the Blessed One, “there are bodhisattvas who know everything within the range of the divine clairvoyance of the gods of the Caturmahā­rāja­kāyika realm.
